House_rules = {
    "집전체": {
        "크기": {
            "크다": "상상력이 풍부하거나 책임감이 강하다.",
            "크지 않다": None
        },
        "위치": {
            "중앙": "원만하며 사회성이 좋다.",
            "비중앙": None
        }
    },

    "지붕": {
        "유무": {
            "있다": None,
            "없다": None,
        }
    },

    "집벽": {
        "유무": {
            "있다": None,
            "없다": None,
        }
    },

    "문": {
        "유무": {
            "있다": "생각이 다양하고 상상력이 풍부하다. 야심 있고 목표지향적이다.",
            "없다": None
        }
    },
    
    "창문": {
        "개수": {
            "3개 이상": "우호적이고 대인관계에 적극적이다. 야심이 있고 목표지향적이다. 자극을 추구한다.",
            "생략": "계획성 없고 즉흥적인 성향이다. 의심이 많고 대인기피 성향이 강하다."
        },
        "크기": {
            "크다": "호기심이 많다. 야심이 있고 목표지향적이다.",
            "보통": "수용적이고 신뢰를 잘 한다.",
            "작다": None
        }
    },

    "굴뚝": {
        "유무": {
            "없다": "창의적이거나 호기심이 많다. 야심이 있고 목표지향적인 성향이다.",
            "있다": None
        }
    },

    "연기": {
        "유무": {
            "있다": None,
            "없다": None,
        }
    },
    
    "울타리": {
        "유무": {
            "있다": "원기 왕성하고 신체활동이 많다.",
            "없다": "배려 깊고 관용적이다. 자아존중감이 낮다."
        }
    },

    "길": {
        "유무": {
            "있다": None,
            "없다": None,
        }
    },

    "연못": {
        "유무": {
            "있다": "원기 왕성하고 신체활동이 많다. 의심이 많다.",
            "없다": "배려 깊고 관용적이다."
        }
    },

    "산": {
        "유무": {
            "있다": None,
            "없다": None,
        }
    },
    
    "나무": {
        "유무": {
            "있다": "자기주장이 강하고 과시적인 성향이다. 자신감이 크다.",
            "없다": None
        }
    },
    
    "꽃": {
        "유무": {
            "있다": "너그럽고 공감을 잘한다.",
            "없다": None
        }
    },  
    
    "잔디": {
        "유무": {
            "있다": "대인관계에 어려움이 크다.",
            "없다": None
        }
    },
    
    "태양": {
        "유무": {
            "있다": "사람들과 어울리기를 좋아한다.",
            "없다": "우울성이 심하고 반사회성 성향이 강하다."
        }
    }
}

Tree_rules = {
    "나무전체": {
        "크기": {
            "작다": "창의적이다. 의심이 많다. 대인기피 성향이 강하다. 우울하다. 현실감이 떨어진다. 자아존중감이 낮다.",
            "보통": None,
            "크다": "대인관계 폭이 넓다. 민감하고 감각적이다. 변화를 추구하며 진취적이다."
        }
    },

    "기둥": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },
    
    "수관": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },

    "가지": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },
    
    "뿌리": {
        "유무": {
            "있다": "호기심이 많다. 사고가 유연하다.",
            "없다": None
        }
    },

    "나뭇잎": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },

    "꽃": {
        "유무": {
            "있다": "원기 왕성하다.",
            "없다": None
        }
    },

    "열매": {
        "유무": {
            "있다": "우호적이고 대인관계에 적극적이다. 주의 산만하고 충동적이다. 심약하다. 미적 감각이 높다. 진취적이다.",
            "없다": None
        }
    },

    "그네": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },
    
    "새": {
        "유무": {
            "있다": "자신감이 크다.",
            "없다": None
        }
    },

    "다람쥐": {
        "유무": {
            "있다": "자신감이 크다.",
            "없다": None
        }
    },

    "구름": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },
    
    "달": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },
    
    "별": {
        "유무": {
            "있다": None,
            "없다": None
        }
    }
}

Person_rules = {
    "사람전체": {
        "크기": {
            "크다": "생각이 다양하고 상상력이 풍부하다. 현실감이 떨어진다.",
            "보통": "민감하고 감각적이다.",
            "작다": "자신감이 없다. 자아존중감이 약하다."
        }
    },

    "머리": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },

    "얼굴": {
        "종류": {
            "완전": "책임감이 강하다.",
            "불완전": "자신감이 없다."
        }
    },
    
    "눈": {
        "종류": {
            "한쪽 눈": "야심적이고 목표지향적이다. 의심이 많다. 적대감이 크다. 자신감이 부족하다. 현실감이 부족하다.",
            "양쪽 눈": "우호적이고 대인관계에 적극적이다. 자신감이 크다. 계획성이 있고 주의 깊다.",
            "없다": None
        }
    },
    
    "코": {
        "유무": {
            "있다": "우호적이고 인정이 많다. 책임감이 강하다. 자제력이 강하다. 자아존중감이 약하다. 낙관적이다. 야심 있고 목표지향적이다.",
            "없다": "자신감이 없다. 스트레스에 둔감하다."
        }
    },
    
    "입": {
        "유무": {
            "있다": "트라우마를 경험한 적이 있다. 쉽게 상처받는 경향이 있다. 대인관계에 적극적이다.",
            "없다": "대인관계에 어려움이 크다. 반사회적 성향이 강하다."
        }
    },

    "귀": {
        "유무": {
            "있다": "생각이 다양하고 상상력이 풍부하다.",
            "없다": None
        }
    },
    
    "머리카락": {
        "유무": {
            "있다": "너그럽고 공감을 잘한다. 배려 깊다.",
            "없다": "지나치게 허용적이다."
        }
    },
    
    "목": {
        "유무": {
            "있다": "배려 깊고 관용적이다. 의존적이고 심약하다.",
            "없다": "우울하다. 반사회적 성향이 강하다. 인내심이 강하다."
        }
    },
    
    "상체": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },
    
    "팔": {
        "유무": {
            "있다": "불안하다. 주장이 강하고 과시적인 성향이다. 타인과의 소통이 원활하다.",
            "없다": "대인관계에 어려움이 크다. 우울하다. 모험적이고 자극을 추구한다."
        }
    },

    "손": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },

    "다리": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },

    "발": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },

    "단추": {
        "유무": {
            "있다": "자극을 추구한다.",
            "없다": None
        }
    },
    
    "주머니": {
        "유무": {
            "있다": None,
            "없다": None
        }
    },

    "운동화": {
        "유무": {
            "있다": "사회성이 좋다.",
            "없다": None
        }
    }, 

    "여자구두": {
        "유무": {
            "있다": "사회성이 좋다.",
            "없다": None
        }
    }
}